let readMore = document.querySelector('#readm'); 
let aboutPara = document.querySelector('#aboutPara')

readMore.onclick = () =>{
    if (aboutPara.textContent == "باعتباري مطورًا للألعاب والويب، فإنني أزدهر من خلال دمج الإبداع والخبرة التقنية لبناء تجارب رقمية غامرة. رؤيتي عبارة عن نسيج من التصميم والتعليمات البرمجية، حيث تنبض الحياة بالسرد التفاعلي والوظائف الديناميكية. إن شغفي بالألعاب يغذي ابتكاراتي، ويدفعني إلى التنقل بين تعقيدات البرمجة والتصميم لإظهار رؤيتي. مع التزامي العميق بتجربة المستخدم، أقوم بتصميم واجهات سلسة وجذابة تعكس تفاني وموهبتي في المشهد المتطور باستمرار لتطوير الألعاب والويب.") {
        aboutPara.textContent = "منغمسًا في عالم متعدد الأوجه لتطوير الألعاب والويب، أجد نفسي في رابطة الإبداع والخبرة التقنية، حيث يسمح لي الجمع بين هاتين القوتين بنحت تجارب رقمية غامرة. في صميم عملي يكمن اندماج معقد بين التصميم والبرمجة، وهي سيمفونية فنية حيث تتلاقى الروايات التفاعلية والوظائف الديناميكية لإنشاء نسيج رقمي نابض بالحياة. إن شغفي الثابت بالألعاب هو الذي يدفعني إلى الابتكار، ويعمل كمصدر دائم للإلهام، ويحثني على استكشاف التعقيدات الكامنة في البرمجة والتصميم والتغلب عليها. هذا الدافع الذي لا هوادة فيه يقودني عبر متاهة التحديات، ويرشدني إلى إظهار الرؤى التي تحرك مخيلتي. إن عملية التطوير هي أكثر من مجرد صياغة سطور من التعليمات البرمجية أو تصميم الرسومات؛ إنها رحلة دائمة التطور. يمثل كل سطر من التعليمات البرمجية حلاً للغز، وضربة فرشاة تم اختيارها بعناية تساهم في لوحة قماشية أكبر أصنعها بدقة. تصبح اللوحة القماشية، في هذه الحالة، عالمًا تفاعليًا وديناميكيًا حيث لا يكون المستخدمون مجرد مشاركين، بل أبطال في القصص التي أنسجها. من خلال الاهتمام الدقيق بالتفاصيل، أسعى إلى بناء بيئات تأسر وتتفاعل، وتتجاوز مجرد الوظائف لإثارة المشاعر وتغمر المستخدمين في تجارب لا تُنسى. إن مشهد التنمية هو مشهد من التطور الدائم، ويتميز بتضاريسه المتغيرة باستمرار. ولا تتطلب هذه البيئة المتغيرة باستمرار الخبرة التقنية فحسب، بل تتطلب أيضًا القدرة على التكيف والرغبة في التعلم المستمر. وفي هذا المجال، أصقل مهاراتي بلا كلل، وأبحث عن أحدث التقنيات واتجاهات الصناعة لضمان بقاء عملي في طليعة الابتكار. علاوة على ذلك، فإن تجربة المستخدم هي ركيزة أتمسك بها بأقصى قدر من التقدير. إن صياغة واجهات سلسة وبديهية ليست مجرد مهمة ولكنها شهادة على تفانيي في التصميم الذي يركز على المستخدم. أسعى جاهداً لتوقع احتياجات المستخدمين، واستباق تفاعلاتهم، وتزويدهم بتجربة طبيعية وغامرة. إن رضا المستخدم الذي يتنقل بسلاسة عبر التصميم، ويختبر سيولة التفاعل، والشعور بالتفاعل مع المنتج هو مكافأة تدفعني باستمرار إلى تحقيق التميز."
        readMore.textContent = 'إقرأ أقل'
    }
    else if (aboutPara.textContent == "منغمسًا في عالم متعدد الأوجه لتطوير الألعاب والويب، أجد نفسي في رابطة الإبداع والخبرة التقنية، حيث يسمح لي الجمع بين هاتين القوتين بنحت تجارب رقمية غامرة. في صميم عملي يكمن اندماج معقد بين التصميم والبرمجة، وهي سيمفونية فنية حيث تتلاقى الروايات التفاعلية والوظائف الديناميكية لإنشاء نسيج رقمي نابض بالحياة. إن شغفي الثابت بالألعاب هو الذي يدفعني إلى الابتكار، ويعمل كمصدر دائم للإلهام، ويحثني على استكشاف التعقيدات الكامنة في البرمجة والتصميم والتغلب عليها. هذا الدافع الذي لا هوادة فيه يقودني عبر متاهة التحديات، ويرشدني إلى إظهار الرؤى التي تحرك مخيلتي. إن عملية التطوير هي أكثر من مجرد صياغة سطور من التعليمات البرمجية أو تصميم الرسومات؛ إنها رحلة دائمة التطور. يمثل كل سطر من التعليمات البرمجية حلاً للغز، وضربة فرشاة تم اختيارها بعناية تساهم في لوحة قماشية أكبر أصنعها بدقة. تصبح اللوحة القماشية، في هذه الحالة، عالمًا تفاعليًا وديناميكيًا حيث لا يكون المستخدمون مجرد مشاركين، بل أبطال في القصص التي أنسجها. من خلال الاهتمام الدقيق بالتفاصيل، أسعى إلى بناء بيئات تأسر وتتفاعل، وتتجاوز مجرد الوظائف لإثارة المشاعر وتغمر المستخدمين في تجارب لا تُنسى. إن مشهد التنمية هو مشهد من التطور الدائم، ويتميز بتضاريسه المتغيرة باستمرار. ولا تتطلب هذه البيئة المتغيرة باستمرار الخبرة التقنية فحسب، بل تتطلب أيضًا القدرة على التكيف والرغبة في التعلم المستمر. وفي هذا المجال، أصقل مهاراتي بلا كلل، وأبحث عن أحدث التقنيات واتجاهات الصناعة لضمان بقاء عملي في طليعة الابتكار. علاوة على ذلك، فإن تجربة المستخدم هي ركيزة أتمسك بها بأقصى قدر من التقدير. إن صياغة واجهات سلسة وبديهية ليست مجرد مهمة ولكنها شهادة على تفانيي في التصميم الذي يركز على المستخدم. أسعى جاهداً لتوقع احتياجات المستخدمين، واستباق تفاعلاتهم، وتزويدهم بتجربة طبيعية وغامرة. إن رضا المستخدم الذي يتنقل بسلاسة عبر التصميم، ويختبر سيولة التفاعل، والشعور بالتفاعل مع المنتج هو مكافأة تدفعني باستمرار إلى تحقيق التميز.") {
        aboutPara.textContent = 'باعتباري مطورًا للألعاب والويب، فإنني أزدهر من خلال دمج الإبداع والخبرة التقنية لبناء تجارب رقمية غامرة. رؤيتي عبارة عن نسيج من التصميم والتعليمات البرمجية، حيث تنبض الحياة بالسرد التفاعلي والوظائف الديناميكية. إن شغفي بالألعاب يغذي ابتكاراتي، ويدفعني إلى التنقل بين تعقيدات البرمجة والتصميم لإظهار رؤيتي. مع التزامي العميق بتجربة المستخدم، أقوم بتصميم واجهات سلسة وجذابة تعكس تفاني وموهبتي في المشهد المتطور باستمرار لتطوير الألعاب والويب.'
        readMore.textContent = 'إقرأ المزيد'
    }
}

let sections = document.querySelectorAll('section')
let navLinks = document.querySelectorAll('header nav a')

window.onscroll = () => {
    sections.forEach(sec => {
        let top = window.scrollY;
        let offset = sec.offsetTop - 100;
        let height = sec.offsetHeight;
        let id = sec.getAttribute('id');

        if(top >= offset && top < offset + height){
            navLinks.forEach(link =>{
                link.classList.remove('active');
                document.querySelector('header nav a[href*=' + id + ']').classList.add('active');
            });
            sec.classList.add('show-animate');
        }
        else{
            sec.classList.remove('show-animate');

        }
    })
    let header = document.querySelector('header');
    header.classList.toggle("sticky", window.scrollY > 100);

    menuIcon.classList.remove('bx-x');
    nav.classList.remove('active');

    let footer = document.querySelector('footer');

    footer.classList.toggle('show-animate', this.innerHeight + this.scrollY >= document.scrollingElement.scrollHeight);
}

let menuIcon = document.querySelector('#menu-icon');
let nav = document.querySelector('.navbar');

menuIcon.onclick = () =>{
    menuIcon.classList.toggle('bx-x')
    nav.classList.toggle('active')
}


